Revit 2027 API
Group.HideAttachedDetailGroups Method
 Hides the element group's attached detail groups of the input group type that are compatible with the input view.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void HideAttachedDetailGroups(
	View view,
	ElementId detailGroupTypeId
)
Public Sub HideAttachedDetailGroups (
	view As View,
	detailGroupTypeId As ElementId
)
public:
void HideAttachedDetailGroups(
	View^ view,
	ElementId^ detailGroupTypeId
)
member HideAttachedDetailGroups :
        view : View *
        detailGroupTypeId : ElementId -> unit
Parameters
view View
 The view that the attached detail groups must be compatible with.
detailGroupTypeId ElementId
 Only attached detail groups of this type will be hidden.
Exceptions
Exception | Condition
ArgumentException |  The attached detail group detailGroupTypeId does not match the input view's orientation.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The input group is not a model group and can therefore not have attached detail groups.
See Also
Reference
Group Class
Autodesk.Revit.DB Namespace